app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    if user_signed_in?
    @items = Item.where(:user_id => current_user.id).order("created_at DESC")

INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "take a poop"], ["description", ""], ["created_at", "2018-07-20 16:04:11.074994"], ["updated_at", "2018-07-20 16:04:11.074994"], ["user_id", 2]]
---
  def create
    @item = current_user.items.build(item_params)
    if @item.save

UPDATE "items" SET "title" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "take a poop3"], ["updated_at", "2018-07-20 16:44:43.029820"], ["id", 8]]
---
  def update
    if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2018-07-20 16:24:29.303444"], ["updated_at", "2018-07-20 16:24:29.304575"], ["id", 8]]
---
  def complete
    @item = Item.find(params[:id])
    @item.update_attribute(:completed_at, Time.now)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def find_item
      @item = Item.find(params[:id])